DIYzzuzpb/contiki-mplabx/platform/pic18f97j60-family/HardwareProfile.h
	#if defined(__dsPIC30F__)
		#define ADC1BUF0			ADCBUF0
		#define AD1CHS				ADCHS
		#define	AD1CON1				ADCON1
		#define AD1CON2				ADCON2
		#define AD1CON3				ADCON3
		#define AD1PCFGbits			ADPCFGbits
		#define AD1CSSL				ADCSSL
		#define AD1IF				ADIF
		#define AD1IE				ADIE
		#define _ADC1Interrupt		_ADCInterrupt
	#endif

	#if defined(DSPICDEMNET1) || defined(DSPICDEMNET2)
		#define UBRG					U1BRG
		#define UMODE					U1MODE
		#define USTA					U1STA
		#define BusyUART()				BusyUART1()
		#define CloseUART()				CloseUART1()
		#define ConfigIntUART(a)		ConfigIntUART1(a)
		#define DataRdyUART()			DataRdyUART1()
		#define OpenUART(a,b,c)			OpenUART1(a,b,c)
		#define ReadUART()				ReadUART1()
		#define WriteUART(a)			WriteUART1(a)
		#define getsUART(a,b,c)			getsUART1(a,b,c)
		#define putsUART(a)				putsUART1((unsigned int *)a)
		#define getcUART()				getcUART1()
		#define putcUART(a)				WriteUART1(a)
		#define putrsUART(a)			putsUART1((unsigned int *)a)
	#else
		#define UBRG					U2BRG
		#define UMODE					U2MODE
		#define USTA					U2STA
		#define BusyUART()				BusyUART2()
		#define CloseUART()				CloseUART2()
		#define ConfigIntUART(a)		ConfigIntUART2(a)
		#define DataRdyUART()			DataRdyUART2()
		#define OpenUART(a,b,c)			OpenUART2(a,b,c)
		#define ReadUART()				ReadUART2()
		#define WriteUART(a)			WriteUART2(a)
		#define getsUART(a,b,c)			getsUART2(a,b,c)
		#if defined(__C32__)
			#define putsUART(a)			putsUART2(a)
		#else
			#define putsUART(a)			putsUART2((unsigned int*)a)
		#endif
		#define getcUART()				getcUART2()
		#define putcUART(a)				WriteUART(a)
		#define putrsUART(a)			putsUART(a)
	#endif
#endif


#endif
